Revit 2027 API
MEPModel.GetAssignedElectricalSystems Method
 Retrieves the electrical systems this electrical panel currently is assigned to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElectricalSystem> GetAssignedElectricalSystems()
Public Function GetAssignedElectricalSystems As ISet(Of ElectricalSystem)
public:
ISet<ElectricalSystem^>^ GetAssignedElectricalSystems()
member GetAssignedElectricalSystems : unit -> ISet<ElectricalSystem>
Return Value
ISet<ElectricalSystem>
Remarks
 This property returns a set of Electrical Systems. If there are no electrical systems created for this model, this property will be an empty set. This method supersedes an older AssignedElectricalSystems property which has been deprecated.
See Also
Reference
MEPModel Class
Autodesk.Revit.DB Namespace